% 横坐标序列
x = 1:20;

% 第一组损失值
loss_values1 = [0.87, 0.65, 0.50, 0.30, 0.20, 0.100, 0.02, 0.01, 0.0002, 0.0001, 0.00007, 0.00005, 0.00003, 0.00002, 0.00001, 0.000007, 0.000005, 0.000003, 0.000002, 0.000001];

% 第二组损失值
manual_loss_values = [0.95, 0.75, 0.40, 0.20, 0.10, 0.001, 0.0009, 0.0008, 0.0006, 0.0004, 0.0002, 0.0001, 0.00005, 0.00001, 0.000005, 0.000001, 0.0000005, 0.0000002, 0.0000001, 0.00000005];

% 可视化两组损失值
figure;
set(gcf, 'Color', 'w'); % 设置整个图形窗口背景为白色
plot(x, loss_values1, 'k-', 'LineWidth', 2, 'DisplayName', '训练集'); % 使用黑色实线绘制第一组
hold on;
plot(x, manual_loss_values, 'k--', 'LineWidth', 2, 'DisplayName', '测试集'); % 使用黑色虚线绘制第二组
xlabel('轮次');
ylabel('损失');
ylim([0, 1]);
legend show; % 显示图例
